Revit 2024 API
SolidCurveIntersection Members
The SolidCurveIntersection type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the SolidCurveIntersection
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetCurveSegment
 Gets the curve segment generated by intersection.
GetCurveSegmentExtents
 Gets the extents for the given curve segment generated by intersection.
GetEnumerator
Returns an enumerator that iterates through a collection.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ResultType
 The result type used to calculate the intersections.
SegmentCount
 The number of segments in the results.
See Also
SolidCurveIntersection Class
Autodesk.Revit.DB Namespace